{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v3.3.0",
    "convertedBy": null,
    "modelTopology": {
      "keras_version": "2.3.1",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential_1",
          "layers": [
            {
              "class_name": "Dense",
              "config": {
                "units": 128,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "name": "dense",
                "trainable": true,
                "batch_input_shape": [
                  null,
                  40
                ]
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "name": "dense_1",
                "trainable": true
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "units": 30,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "name": "dense_2",
                "trainable": true
              }
            }
          ]
        }
      }
    },
    "training_config": null,
    "weights_manifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "dense/kernel",
            "shape": [
              40,
              128
            ],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [
              128
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [
              128,
              64
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [
              64
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [
              64,
              30
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [
              30
            ],
            "dtype": "float32"
          }
        ]
      }
    ],
    "weight_specs": [
      {
        "name": "dense/kernel",
        "shape": [
          40,
          128
        ],
        "dtype": "float32"
      },
      {
        "name": "dense/bias",
        "shape": [
          128
        ],
        "dtype": "float32"
      },
      {
        "name": "dense_1/kernel",
        "shape": [
          128,
          64
        ],
        "dtype": "float32"
      },
      {
        "name": "dense_1/bias",
        "shape": [
          64
        ],
        "dtype": "float32"
      },
      {
        "name": "dense_2/kernel",
        "shape": [
          64,
          30
        ],
        "dtype": "float32"
      },
      {
        "name": "dense_2/bias",
        "shape": [
          30
        ],
        "dtype": "float32"
      }
    ]
  }
  